/**
 * \mainpage
 * # Лабораторна робота 11
 *
 * \author Панкеєв ВЛадислав, КН-922Б
 */

/*!
\file main.c
\brief Головний файл

Це файл, який містить точку входу,
виклики функцій filter_arr та значення для аргументів цих функцій.
*/

#include "lib.h"

/**
 Головна функція.

 Послідовність дій

- Створити масив який ми будемо перевіряти чи є в масиві елементи, що повторюються; якщо такі є, то створити масив, в якому вказати, скільки разів які елементи повторюються.
- Створити вказівник який ми будемо використовувати як посилання на масив.
- Створюємо змінну яка зберігая кількість елементів у масиві рахуючи з 0.
- Викликаємо функцію filter_arr.

 
*/

int main()
{
	int arr_const[] = { 23, 89, 89, 23, 67, 89, 0, 37, 37 };
	int *arr = arr_const;
	int qua_elemnts = 8;

	filter_arr(arr, qua_elemnts, 0);

	return 0;
}
